Revit 2027 API
RebarConstraint.TargetIsHookBend Method
 Returns true if the TargetRebarConstraintType of the RebarConstraint is 'HookBend'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool TargetIsHookBend()
Public Function TargetIsHookBend As Boolean
public:
bool TargetIsHookBend()
member TargetIsHookBend : unit -> bool
Return Value
Boolean
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace